#### Terraform Init: `✅`
#### Terraform Plan: `✅ 2 to add, 5 to change, 2 to destroy.`

<details>
<summary>Show Plan</summary>

```
data.hetznerdns_zone.this: Reading...
data.cloudinit_config.this: Reading...
hcloud_network.this: Refreshing state... [id=10373733]
hcloud_ssh_key.default: Refreshing state... [id=24905759]
data.hcloud_image.this: Reading...
data.cloudinit_config.this: Read complete after 0s [id=2992828241]
hcloud_firewall.basic: Refreshing state... [id=1748182]
hcloud_network_subnet.this: Refreshing state... [id=10373733-10.0.1.0/24]
data.hetznerdns_zone.this: Read complete after 1s [id=iFtghhzsF25nw7Wqa2JMsJ]
data.hcloud_image.this: Read complete after 1s
hcloud_server.this: Refreshing state... [id=66549796]
hetznerdns_record.bookmarks-api: Refreshing state... [id=81253d86efc1c38e4afb06c662d6a409]
hetznerdns_record.bookmarks: Refreshing state... [id=da4433c705ee878f5f69348f54b956ef]
hetznerdns_record.homepage: Refreshing state... [id=912db7ec956005d7343406b8b2adb320]
hetznerdns_record.geometrierechner: Refreshing state... [id=ec7af5d1c5e38277f29fb0a68ab796b1]
hcloud_volume.this: Refreshing state... [id=101632658]
hcloud_server_network.this: Refreshing state... [id=66549796-10373733]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # hcloud_server.this must be replaced
-/+ resource "hcloud_server" "this" {
      + backup_window              = (known after apply)
      ~ datacenter                 = "fsn1-dc14" -> (known after apply)
      ~ id                         = "66549796" -> (known after apply)
      ~ ipv4_address               = "188.245.227.94" -> (known after apply)
      ~ ipv6_address               = "2a01:4f8:c012:20a7::1" -> (known after apply)
      ~ ipv6_network               = "2a01:4f8:c012:20a7::/64" -> (known after apply)
      - labels                     = {} -> null
        name                       = "personal-projects"
      - placement_group_id         = 0 -> null
      ~ primary_disk_size          = 40 -> (known after apply)
      ~ status                     = "running" -> (known after apply)
      ~ user_data                  = "yM40xChoQ2AChCLqAAgpIMStuuw=" -> "o+Yk7cU2jZfDf5E5sgKhTJcsesc=" # forces replacement
        # (12 unchanged attributes hidden)
    }

  # hcloud_server_network.this must be replaced
-/+ resource "hcloud_server_network" "this" {
      - alias_ips   = [] -> null
      ~ id          = "66549796-10373733" -> (known after apply)
      ~ mac_address = "86:00:00:b5:1f:16" -> (known after apply)
      ~ server_id   = 66549796 -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # hcloud_volume.this will be updated in-place
  ~ resource "hcloud_volume" "this" {
        id                = "101632658"
        name              = "persistent-storage"
      ~ server_id         = 66549796 -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # hetznerdns_record.bookmarks will be updated in-place
  ~ resource "hetznerdns_record" "bookmarks" {
        id      = "da4433c705ee878f5f69348f54b956ef"
        name    = "bookmarks"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.bookmarks-api will be updated in-place
  ~ resource "hetznerdns_record" "bookmarks-api" {
        id      = "81253d86efc1c38e4afb06c662d6a409"
        name    = "api.bookmarks"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.geometrierechner will be updated in-place
  ~ resource "hetznerdns_record" "geometrierechner" {
        id      = "ec7af5d1c5e38277f29fb0a68ab796b1"
        name    = "geometrierechner"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # hetznerdns_record.homepage will be updated in-place
  ~ resource "hetznerdns_record" "homepage" {
        id      = "912db7ec956005d7343406b8b2adb320"
        name    = "@"
      ~ value   = "188.245.227.94" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 5 to change, 2 to destroy.

Changes to Outputs:
  ~ server_ip = "188.245.227.94" -> (known after apply)
  ~ status    = "running" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>